export default {
    ERROR: {
        APPOINTMENT_CROSS_TIME: 'Интервал записи пересекается с записями других пациентов',
        LOCK_CROSS_TIME: 'Интервал записи заблокирован оператором',
        DOCTOR_OUT_OF_TIME: 'Интервал записи выходит за пределы рабочего времени врача',
        DOCTOR_LOCK_OUT_OF_TIME: 'Интервал блокировки выходит за пределы рабочего времени врача',
        DOCTOR_LOCK_OVERLAP: 'Интервал блока пересекается с другими блокировками',
        DOCTOR_LOCK_APPOINTMENT_OVERLAP: 'Интервал блока пересекается с записью на приём',
    }
}
